shizhe430/H7serial/H7serial.ioc
STMicroelectronics.X-CUBE-AI.10.2.0.IPParameters=HeapSize,StackSize,ModelHashList,ModelNameList,WorkingBufferStartAddrList,ActivationBuffers,ActivationSizes,ActivationNames,InternalRamActivationBufferMaxSize,ActivationBufferSizeList,MaximumNumberOfInputLayer,MaximumNumberOfOutputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer,ReadyForCodeGeneration,ModelName-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelKind-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelCompression-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,LatestDirectoryUsed-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,copyWeightToRam-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,outputDirectory-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,useInputAllocation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,useOutputAllocation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,customLayerConfigEnabled-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,optimization-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,noOnnxIoTranspose-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelMacc-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelActualCompression-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelRamOccupation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelFlashOccupation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ModelType-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ValidationInputFileHistory-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,ValidationInputFile-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176,XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ModelStructureFile-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176
STMicroelectronics.X-CUBE-AI.10.2.0.InternalRamActivationBufferMaxSize=AI_WATERLEVEL_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=D\:\\
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumSizeOfInputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumSizeOfOutputLayer=1,1
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=259124
STMicroelectronics.X-CUBE-AI.10.2.0.ModelHashList=e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=ONNX
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=16479543
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=waterlevel
STMicroelectronics.X-CUBE-AI.10.2.0.ModelNameList=waterlevel
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=187088
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=D\:\\v3_w05_origline_plus_newdata_qat_st_pure_int8.onnx
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ReadyForCodeGeneration=true
STMicroelectronics.X-CUBE-AI.10.2.0.StackSize=0x2000
STMicroelectronics.X-CUBE-AI.10.2.0.ValidationInputFile-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=D\:\\calib_200.npz
STMicroelectronics.X-CUBE-AI.10.2.0.ValidationInputFileHistory-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=D\:\\calib_200.npz,D\:\\calib_200.npz,D\:\\calib_200.npz,D\:\\v3_w05_origline_plus_newdata_tuned_PerTensor_quant_calib_500_weighted_plus_hardset_npz_1.onnx
STMicroelectronics.X-CUBE-AI.10.2.0.WorkingBufferStartAddrList=0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.10.2.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.10.2.0.copyWeightToRam-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=false
STMicroelectronics.X-CUBE-AI.10.2.0.customLayerConfigEnabled-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=false
STMicroelectronics.X-CUBE-AI.10.2.0.noOnnxIoTranspose-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=false
STMicroelectronics.X-CUBE-AI.10.2.0.optimization-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=time
STMicroelectronics.X-CUBE-AI.10.2.0.outputDirectory-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=D\:\\
STMicroelectronics.X-CUBE-AI.10.2.0.useInputAllocation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=true
STMicroelectronics.X-CUBE-AI.10.2.0.useOutputAllocation-e1f2f966a8f24512d56db1f2ac5999c9a4b31a567fc9011c52fa71a225c07176=true
STMicroelectronics.X-CUBE-AI.10.2.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USART2.IPParameters=VirtualMode-Asynchronous
USART2.VirtualMode-Asynchronous=VM_ASYNC
USART3.IPParameters=VirtualMode-Asynchronous
USART3.VirtualMode-Asynchronous=VM_ASYNC
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
isbadioc=false
